Autodesk.Revit.DB.Fabrication.DesignToFabricationConverter.SetMapForFamilySymbolToFabricationPartType(System.Collections.Generic.IDictionary{Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId})
Set a map for the conversion of in line family symbols to similar fabrication part types.
typeMappings:
The map containing the family symbol element identifiers to the fabrication part type element identifiers to convert to.
Returns:
If the mapping is properly structured, DesignToFabricationMappingResult.Success is returned. Otherwise, consult the members of DesignToFabricationMappingResult to understand why this call failed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.Fabrication.DesignToFabricationConverter.Convert(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId},System.Int32)
Converts the set of MEP design elements into fabrication parts.
Remarks:
After this method has been invoked, call:
Autodesk.Revit.DB.Fabrication.DesignToFabricationConverter.GetConvertedFabricationParts to get a set of element identifiers for the newly created fabrication parts.Autodesk.Revit.DB.Fabrication.DesignToFabricationConverter.GetElementsWithOpenConnector to get a set of fabrication part or MEP design element identifiers with open connectors, caused by fittings failing to convert.
selection:
The set of element identifiers to convert from MEP design elements to fabrication parts.
serviceId:
The identifier of the fabrication service.
Throws Autodesk.Revit.Exceptions.ArgumentException:
the selection contains invalid elements to convert.
-or-
the specified fabrication service is not valid for all domains in the selection.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
no fabrication configuration is loaded.
Since:
2017

Autodesk.Revit.DB.Fabrication.DesignToFabricationConverter.#ctor(Autodesk.Revit.DB.Document)
Creates a new instance of the DesignToFabricationConverter class.
document:
A document in which to convert MEP design elements into fabrication parts.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Fabrication.DesignToFabricationConverter
This class represents the MEP design to fabrication part convert tool.
Remarks:
After a new instance of the class is created, call the Convert method to convert the MEP design elements into
fabrication parts. Use the method SetMapForFamilySymbolToFabricationPartType to optionally convert family content
to fabrication parts prior to calling Convert by providing a mapping of family symbols to fabrication parts types.
If not set, then during conversion these families will remain and any connections to other converted elements will be
maintained. After the convert method has been invoked, query the class to obtain more information about the conversion:
Autodesk.Revit.DB.Fabrication.DesignToFabricationConverter.GetConvertedFabricationParts to get a set of element identifiers for the newly created fabrication parts.Autodesk.Revit.DB.Fabrication.DesignToFabricationConverter.GetElementsWithOpenConnector to get a set of fabrication part or MEP design element identifiers with open connectors, caused by fittings failing to convert.
Since:
2017